export default {
  projections: {
    РегистрацКлючаE: {
      дата: {
        __caption__: 'Дата'
      },
      номерКлюча: {
        __caption__: 'Ключ'
      },
      комната: {
        __caption__: 'Номер комнаты',
        считыватель: {
          __caption__: '',
          уникальныйКод: {
            __caption__: 'Уникальный код'
          }
        }
      },
      срокДействия: {
        __caption__: 'Карта действует до:'
      },
      карта: {
        __caption__: 'Номер карты'
      },
      сотрудник: {
        __caption__: 'Ответственный'
      }
    },
    РегистрацКлючаL: {
      дата: {
        __caption__: 'Дата'
      },
      номерКлюча: {
        __caption__: 'Ключ'
      },
      комната: {
        __caption__: 'Номер комнаты',
        номерКомнаты: {
          __caption__: 'Номер комнаты'
        },
        считыватель: {
          __caption__: '',
          уникальныйКод: {
            __caption__: 'Уникальный код'
          }
        }
      },
      карта: {
        __caption__: 'Номер карты',
        номерКарты: {
          __caption__: 'Номер карты'
        }
      },
      срокДействия: {
        __caption__: 'Карта действует до:'
      },
      сотрудник: {
        __caption__: 'Ответственный',
        фИО: {
          __caption__: 'Ответственный'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    номерКлюча: {
      __caption__: 'Ключ'
    },
    срокДействия: {
      __caption__: 'Карта действует до:'
    },
    карта: {
      __caption__: 'Номер карты'
    },
    комната: {
      __caption__: 'Номер комнаты'
    },
    сотрудник: {
      __caption__: 'Ответственный'
    }
  }
};
