export default {
  projections: {
    КомнатаE: {
      номерКомнаты: {
        __caption__: 'Номер комнаты'
      },
      этаж: {
        __caption__: 'Этаж'
      },
      количествоМест: {
        __caption__: 'Количество мест'
      },
      считыватель: {
        __caption__: 'Уникальный код считывателя'
      }
    },
    КомнатаL: {
      номерКомнаты: {
        __caption__: 'Номер комнаты'
      },
      этаж: {
        __caption__: 'Этаж'
      },
      количествоМест: {
        __caption__: 'Количество мест'
      },
      считыватель: {
        __caption__: 'Уникальный код считывателя',
        уникальныйКод: {
          __caption__: 'Уникальный код считывателя'
        }
      }
    }
  },
  validations: {
    количествоМест: {
      __caption__: 'Количество мест'
    },
    номерКомнаты: {
      __caption__: 'Номер комнаты'
    },
    этаж: {
      __caption__: 'Этаж'
    },
    считыватель: {
      __caption__: 'Уникальный код считывателя'
    }
  }
};
