export default {
  projections: {
    ГостьE: {
      фИО: {
        __caption__: 'ФИО'
      },
      датаРождения: {
        __caption__: 'Дата рождения'
      },
      данныеПаспорта: {
        __caption__: 'Серия и номер паспорта'
      },
      телефон: {
        __caption__: 'Телефон'
      },
      почта: {
        __caption__: 'E-mail'
      },
      регистрацКлюча: {
        __caption__: 'Номер ключа',
        комната: {
          __caption__: '',
          номерКомнаты: {
            __caption__: 'Комната'
          }
        }
      }
    },
    ГостьL: {
      фИО: {
        __caption__: 'ФИО'
      },
      датаРождения: {
        __caption__: 'Дата рождения'
      },
      данныеПаспорта: {
        __caption__: 'Серия и номер паспорта'
      },
      телефон: {
        __caption__: 'Телефон'
      },
      почта: {
        __caption__: 'E-mail'
      },
      регистрацКлюча: {
        __caption__: 'Номер ключа',
        номерКлюча: {
          __caption__: 'Номер ключа'
        },
        комната: {
          __caption__: '',
          номерКомнаты: {
            __caption__: 'Комната'
          }
        }
      }
    }
  },
  validations: {
    данныеПаспорта: {
      __caption__: 'Серия и номер паспорта'
    },
    датаРождения: {
      __caption__: 'Дата рождения'
    },
    почта: {
      __caption__: 'E-mail'
    },
    телефон: {
      __caption__: 'Телефон'
    },
    фИО: {
      __caption__: 'ФИО'
    },
    регистрацКлюча: {
      __caption__: 'Номер ключа'
    }
  }
};
